// JSON ნიშნავს JavaScript Object Notation.

// ეს არის მონაცემთა მიმოცვლის მსუბუქი ფორმატი, რომელიც ადამიანისთვის მარტივი წასაკითხია, ხოლო კომპიუტერისთვის — მარტივი დასამუშავებლად.

// მიუხედავად იმისა, რომ JSON JavaScript-ის სინტაქსზეა დაფუძნებული, ის ენისგან დამოუკიდებელია. თითქმის ყველა თანამედროვე პროგრამირების ენას აქვს JSON-ის წაკითხვისა და შექმნის მხარდაჭერა.


// სინტაქსის ძირითადი წესები
// JSON-ში მონაცემები წარმოდგენილია "გასაღები-მნიშვნელობის" (key/value) წყვილებად.

// მონაცემები გამოიყოფა მძიმით (,).

// ობიექტები მოთავსებულია ფიგურულ ფრჩხილებში ({ }).

// მასივები მოთავსებულია კვადრატულ ფრჩხილებში ([ ]).

// მნიშვნელოვანი: JSON-ში გასაღები (key) აუცილებლად უნდა იყოს მოთავსებული ორმაგ ბრჭყალებში (" ").


