# საკლასო დავალება:

# შექმენით ანონიმური ფუნქცია, რომელსაც გადაეცემა სთრინგი. ფუნქციამ სთრინგი უნდა დააბრუნოს შემობრუნებული და შემდეგ capitalized ფორმატში გადაყვანილი. 

# ფუნქცია გამოიძახეთ 3-ჯერ, გადაეცით განსხვავებული არგუმენტები

reversed_capitalized = lambda string: string[::-1].capitalize()
print(reversed_capitalized("nini"))
print(reversed_capitalized("pheradze"))
print(reversed_capitalized("GOA student"))

# შექმენით ანონიმური ფუნქცია, რომელიც უბრალოდ რიცხვს გააორმაგებს და ეგრევე გამოიძახეთ ის.
print((lambda n: n *2) (10))


# შექმენით საწყისი მთელი რიცხვების სია 10 ელემენტით.

# პირდაპირ დაბეჭდეთ list ფუნქციას გადაცემული map-ის ობიექტი და მაპმა რა უნდა გააკეთოს: საწყისი სიის თითოეული ელემენტი ააკვადრატოს
print(list(map(lambda n : n**2, range(10))))

