// შექმენით ფუნქცია სახელად discountFunc. ამ ფუნქციას პარამეტრი არ სჭირდება. ფუნქციაში მომხმარებელს შემოატანინეთ ასაკი. 

// თუ ასაკი ნაკლებია 18-ზე, დაუბეჭდეთ 20%, თუ ასაკი მეტია ან ტოლია 18-ზე და ნაკლებია 65-ზე, დაუბეჭდეთ 5%, ხოლო ყველა სხვა დანარჩენ შემთხვევაში დაუბეჭდეთ 10%.

// ფუნქცია გამოიძახეთ მაშინ, როდესაც ვებსაიტზე მომხმარებელი დააკლიკებს ღილაკს


function discountFunc() {
    let user = prompt("Enter Your Age: ");

    if (user > 18) {
        alert("20% Discount");
    } else if (user >= 18 && user < 65) {
        alert("5% Discount");
    } else {
        alert("10% Discount")
    }
}

discountFunc()


// შემოიღეთ ცვლადი, სადაც შეინახავთ 0-ს. სანამ ამ ცვლადის მნიშვნელობა ნაკლებია 100-ზე, დაბეჭდეთ ის და მისი ინკრემენტაცია მოახდინეთ 5-ით.

// გამოიყენეთ while ციკლი

let zero = 0;

while (zero < 100){
    console.log(zero);
    zero += 5;
}

// შექმენით for ციკლი, რომელიც იტერაციას მოახდენს 10-ჯერ და თითოუელ იტერაციაზე დაბეჭდავს hello-ს კონსოლში.

for (greeting = "Hello"; greeting < 10; greeting++) {
    console.log(greeting)
}