// მომხმარებელი შეიყვანს თავის დაბადების დღეს და Date ობიექტით გამოთვალე რამდენი დღე დარჩა მის დაბადების დღემდე. 🎂???

const user = prompt("Enter your birthday date: ");



// Stopwatch with Date

// გამოიყენე Date.now() რომ დათვალო რამდენი წამი გავიდა ღილაკზე დაკლიკებიდან.???

let btn = document.createElement('button');



// Random Color Generator

// Math.random()–ით შექმენი შემთხვევითი ფერი RGB ფორმატში, მაგ: "rgb(123, 45, 200)". 🎨 ???



// შექმენით კალდენარი რომელიც დინამიკურად განახდება ანუ ყოველ 1 წამში და და კონკსრეტულ დროს გვეტყვის ???
// <3
// რენდომის გამოყენება