"use strict";
// 1) შექმენით tuple typescript ის დახმარებით და ახსენით კომენტარებით რა არის და როგორ მუშაობს ის (რა შემთხვევაში შეიძლება ამოგიგდოთ პრობლემა)
Object.defineProperty(exports, "__esModule", { value: true });
let tuple = [true, 3, 'Success', false, 8];
console.log(tuple);
// Tuple არის მასივის (Array) სპეციალური სახეობა, რომელიც საშუალებას გვაძლევს შევქმნათ მკაცრად განსაზღვრული სტრუქტურის მონაცემთა კრებული.
// თუ ჩვეულებრივ მასივში (string[]) შეგვიძლია განუსაზღვრელი რაოდენობის ელემენტები ჩავყაროთ, Tuple-ში წინასწარ ვსაზღვრავთ ზუსტად რამდენ ელემენტიანი იქნება მასივი და რა ტიპის მონაცემი იჯდება თითოეულ ინდექსზე.
// Tuple გამოიყენება მაშინ, როდესაც მონაცემებს აქვთ ფიქსირებული, ლოგიკური წყვილი ან სტრუქტურა, სადაც ელემენტების თანმიმდევრობას გადამწყვეტი მნიშვნელობა აქვს.
// RGB ფერები:
// ფერი ყოველთვის შედგება 3 კომპონენტისგან (Red, Green, Blue).
// let activeColor: [number, number, number] = [255, 12, 0];
// 2) შექმენით მათემატიკური ფუნქცია სადაც მოცემული გექნებათ ორი პარამეტრი პირველი ჩვეულებრივი და მეორე rest, ორივეს გაუწერეთ თავისი ტიპი აგრეთვე ფუნქციასაც დაუწერეთ დასაბრუნებელ;ი ტიპი
function multiflyNum(base, ...numbers) {
    return numbers.reduce((total, current) => total * current, base);
}
;
console.log(multiflyNum(2, 3, 4, 5));
// 3) შექმენით სატესტოდ მასივი სადაც გაუწერთ ტიპს და გატესტავთ რა როგორ იმუშავებს მაგალითად push []_ით შეცვლა და ასე შემდეგ
let numbers = [3, 8, 8, 12, 29];
numbers.push(7);
console.log(numbers);
//# sourceMappingURL=script.js.map