// html-ის სტრუქტურაში დაამატეთ ერთი პარაგრაფი და მას გაუწერეთ id.

// js-ში წამოიღეთ ეს პარაგრაფი და მას გაუწერეთ onmouseover event handler. ამ event handler-ს გადაეცით ფუნქცია, რომელიც ვებსაიტზე ტექსტს განალაგებს ცენტრში

let p = document.getElementById('p1');

p.onmouseover = function() {
    p.style.textAlign = "center";
};


// html-ის სტრუქტურაში დაამატეთ ერთი ღილაკი და მას გაუწერეთ ID.

// js-ში წამოიღეთ ეს ელემენტი და მასზე გაწერეთ მოვლენის მსმენელი. მოვლენა უნდა იყოს დაკლიკება და როდესაც ეს მოვლენა მოხდება, გაუშვით ფუნქცია, რომელიც:

//     1. დაბეჭდავს კონსოლში event ობიექტს.
//     2. ვებსაიტის ფონის ფერს გაწერს შავს.
//     3. ვებსაიტის ტექსტის ფერს გაწერს თეთრს.

