// The Hypertext Transfer Protocol (HTTP) მსოფლიო ქსელის საფუძველია და გამოიყენება ვებგვერდების ჩასატვირთად ჰიპერტექსტური ბმულების გამოყენებით. HTTP არის აპლიკაციის დონის პროტოკოლი, რომელიც შექმნილია ქსელურ მოწყობილობებს შორის ინფორმაციის გადასაცემად და მუშაობს ქსელის პროტოკოლების დასტის სხვა ფენებზე.

// WWW ეხება ვებ კლიენტებსა და სერვერებს შორის კომუნიკაციას

// კლიენტ კომპიუტერებსა და ვებ სერვერებს შორის კომუნიკაცია ხორციელდება HTTP მოთხოვნების გაგზავნით და HTTP პასუხების მიღებით.


// HTTP REQUEST
// ბრაუზერი ითხოვს HTML გვერდს. სერვერი აბრუნებს HTML ფაილს.
// ბრაუზერი ითხოვს სტილის ფურცელს. სერვერი აბრუნებს CSS ფაილს.
// ბრაუზერი ითხოვს JPG სურათს. სერვერი აბრუნებს JPG ფაილს.
// ბრაუზერი ითხოვს JavaScript კოდს. სერვერი აბრუნებს JS ფაილს.
// ბრაუზერი ითხოვს მონაცემებს. სერვერი აბრუნებს მონაცემებს (XML ან JSON ფორმატში).


// HTTP Response ნიშნავს, რომ სერვერმა მიიღო კლიენტის მოთხოვნა, დაამუშავა იგი და აბრუნებს შედეგს კონკრეტული სტრუქტურით.

// GET /about HTTP/1.1
// Host: www.example.com
// User-Agent: Chrome/120.0
// Accept: text/html

// POST /login HTTP/1.1
// Host: www.example.com
// Content-Type: application/json
// Content-Length: 45

// {"email":"test@mail.com","password":"12345"}



// HTTP იყენებს მე-80 Port ვებ-კონტენტის, როგორიცაა ვებგვერდები, ვიდეოები, სურათები და ანიმაციები, სერვერიდან კლიენტზე ფორმატირებისა და გადასაცემად. როდესაც ბრაუზერში ვებ-გვერდს იტვირთავთ, თქვენი კომპიუტერი მე-80 Port მეშვეობით ურთიერთობს.