// insertOne() გამოიყენება კოლექციაში 1 დოკუმენტის დასამატებლად
// პარამეტრები:
// 1) ობიექტი (document) - რა მონაცემიც უნდა ჩავამატოთ


// insertMany() რამდენიმე დოკუმენტის ერთდროულად დასამატებლად გამოიყენება
// პარამეტრები: ობიექტის მასივი


// updateOne() გამოიყენება 1 დოკუმენტის გასანახლებლად
// პარამეტრები: 1) რომელი დოკ. უნდა მოძებნოს; 2) რა უნდა შეიცვალოს, ხშირად გამოიყენება $set ოპერატორი; 3) options(არასავალდებულო)


// insertOne() ახალი პოსტს დასამატებლად


// insertMany() ვამატებთ რამდენიმე ობიექტს ერთად

// updateOne() ანახლებს ერთ კონკრეტულ ობიექტს;

