import Parent from './Parent'

function App() {
  // 2) მთავარ App.jsx - ის ფაილში შექმენით ერთი ფუნქცია სახელად handleClick ეს ფუნქცია გადაეცით props - ად შემდეგ კომპონენტს სახლეად Parent, Parent კომპონენტში კი გამოიძახეთ Child კომპონენტი რომელიც props - ად გადმოცემული handleClick ფუნქციას, ღილაკზე დაჭერისას გამოიყენებს

  const handleClick = () => {
    alert("Child Component Button Clicked! (From App)");
  }
  return (
    <>
      {/* გააკეთეთ პრეზენტაცია props drilling - ის შესახებ, კარგად გაიაზრეთ თუ რა დროს და რაში ვიყენებთ ჩვენ მას, ისაუბრეთ დადებით და უარყოფით მხარეებზ */}

      {/* პროპების დამუშავება გულისხმობს მონაცემების React-ში ჩადგმული კომპონენტების რამდენიმე ფენის გავლით გადაცემის პრაქტიკას, მიუხედავად იმისა, რომ შუალედური კომპონენტები პირდაპირ არ იყენებენ ამ მონაცემებს. ეს ნიშნავს, რომ შუალედურ კომპონენტს მონაცემები აუცილებლად არ სჭირდება, მაგრამ მან მაინც უნდა გადასცეს ის შემდეგ კომპონენტს, რაც ქმნის პროპების არასაჭირო და ზოგჯერ გრძელ ჯაჭვს. */}

      {/* Props drillig-ს ახასიათებს შემდეგი: 
        კოდის სირთულე: ეს კომპონენტების ხეს ზედმეტად ართულებს, რადგან შუალედური კომპონენტები იღებენ და გადასცემენ პროპებს მათი გამოყენების გარეშე, რაც ართულებს თქვენს კოდს და იწვევს დაბნეულობას.
        ტექნიკური მომსახურების ხარჯები: პროპებში ნებისმიერი ცვლილება მოითხოვს მრავალი კომპონენტის განახლებას, რაც შეიძლება დიდ დროსა და შეცდომებს მოითხოვდეს.
        შემცირებული წაკითხვადობა: ძნელია იმის თვალყურის დევნება, თუ როგორ და სად მიედინება მონაცემები კომპონენტებში, რაც ართულებს გამართვას და განვითარებას.
        კომპონენტების მჭიდრო კავშირი: კომპონენტები ხდება ნაკლებად მრავალჯერადი და უფრო მჭიდროდ დაკავშირებული, რაც იწვევს მოქნილობის შემცირებას და რეფაქტორინგის სირთულეებს.
        მასშტაბირების პრობლემები: აპლიკაციის ზრდასთან ერთად, პროპების შესწავლა უარესდება, რაც იწვევს შემდგომ სირთულეს და ართულებს აპლიკაციის ეფექტურად მასშტაბირებას. */}

      {/* 2) მთავარ App.jsx - ის ფაილში შექმენით ერთი ფუნქცია სახელად handleClick ეს ფუნქცია გადაეცით props - ად შემდეგ კომპონენტს სახლეად Parent, Parent კომპონენტში კი გამოიძახეთ Child კომპონენტი რომელიც props - ად გადმოცემული handleClick ფუნქციას, ღილაკზე დაჭერისას გამოიყენებს */}

      <div>
        <h1>App Component</h1>
        <Parent handleClick={handleClick}/>
      </div>
    </>
  )
}

export default App
