// DBMS არის პროგრამული უზრუნველყოფა, რომელიც უზრუნველყოფს მონაცემთა ეფექტურ შენახვას, ორგანიზებას და მოძიებას, უზრუნველყოფს მონაცემთა მთლიანობას, უსაფრთხოებას და გამარტივებულ მართვას ბიზნესებისა და ინდუსტრიებისთვის.
// DBMS ტიპები მოიცავს relational, NoSQL, ობიექტზე ორიენტირებულ, იერარქიულ და ქსელურ DBMS-ს, რომელთაგან თითოეული შესაფერისია კონკრეტული გამოყენების შემთხვევებისთვის, როგორიცაა სტრუქტურირებული მონაცემების მართვა, რეალურ დროში დიდი მონაცემების ანალიზი.
// DBMS-ის უპირატესობებია გაუმჯობესებული მონაცემთა მთლიანობა, ძლიერი უსაფრთხოება და წვდომის კონტროლი, სარეზერვო ასლის შექმნისა და აღდგენის შესაძლებლობები და მასშტაბირება მზარდი მონაცემებისა და მომხმარებლის მოთხოვნების მხარდასაჭერად.

// relational database არის ინფორმაციის ერთობლიობა, ის ეფუძნება მონაცემების ცხრილებში შენახვის პრინციპს. მონაცემები თავსდება სვეტებსა და სტრიქონებში. იყენებენ SQL-ს. უზრუნველყოფს ტრანზაქციების სიზუსტეს და საიმედოობას. აადვილებს ერთმანეთთან დაკავშირებული სხვადასხვა მონაცემთა სტრუქტურების დანახვას და გაგებას.

// Non-relational databases ზოგჯერ „NoSQL“-ს უწოდებენ, რაც ნიშნავს „არა მხოლოდ SQL“-ს. მათ შორის მთავარი განსხვავება ინფორმაციის შენახვის წესშია. Non-relational databases მონაცემებს ცხრილებში არ ინახავს და, როგორც წესი, უფრო მოქნილია, ვიდრე ტრადიციული, SQL-ზე დაფუძნებული, relational databases სტრუქტურები.


// SQL არის როგორც "Excel-ის ცხრილების კრებული", NoSQL კი როგორც "საქაღალდე სხვადასხვა ფორმატის ფაილებით".

// სკალირება: SQL იზრდება ვერტიკალურად (უფრო ძლიერი სერვერი), NoSQL ჰორიზონტალურად (მეტი სერვერი).

// გამოყენება: SQL საუკეთესოა ფინანსური სისტემებისთვის და რთული მოთხოვნებისთვის (Queries), NoSQL კი დიდი მონაცემებისთვის (Big Data), სოციალური ქსელებისთვის და Real-time აპლიკაციებისთვის.