// 3) შექმენით ფაილი სადაც კომენტარების სახით ჩამოწერთ ყველა იმ ბრძანების დანიშნულებას რომლებიც თქვენ ისწავლეთ, ახსენით დაწერილი ბრძანებების დანიშნულება + როგორ ხდება მათი გამოყენება

// show dbs - გამოიყენება ყველა db სანახახავად
// use <db> - გამოიყენება ერთი კონკრეტული db-ის გასახსნელად
// db - გამოიყენება ერთი კონკრეტული db-ის გასახსნელად

// .find() მეთოდი გამოიყენება მაშინ როცა რაღაც კონკრეტულის საპოვნელად, მასზე არგუმენტების გადაცემით, არ გადაცემის შემთხვევაში აბრუნებს მთლიან მონაცემებს

// $gt და $lt შედარების ოპერატორები საშუალებას გვაძლევენ, შევადაროთ დოკუმენტები, სადაც კონკრეტული ველის მნიშვნელობა, შესაბამისად, მეტია ან ნაკლებია მოცემულ მნიშვნელობაზე.

// .sort() მეთოდის გამოყენებით, ჩვენ შეგვიძლია დავალაგოთ ჩვენი მოთხოვნის შედეგები კონკრეტული ველის მიხედვით ზრდადი ან კლებადი თანმიმდევრობით.

// ჩვენს მოთხოვნაში შეგვიძლია projection ჩართვა, რათა დაბრუნებული დოკუმენტებიდან გარკვეული ველები ჩავრთოთ ან გამოვრიცხოთ.

// .count() მეთოდი აბრუნებს იმ დოკუმენტების რაოდენობას, რომლებიც შეესაბამება მოთხოვნას.

// • .limit() მეთოდი შეიძლება მიბმული იყოს .find() მეთოდთან და განსაზღვრავს მოთხოვნის მიერ გამოტანილი დოკუმენტების მაქსიმალურ რაოდენობას.

// • $exists ოპერატორი შეიძლება ჩაერთოს მოთხოვნის ფილტრში, რათა დაემთხვეს მხოლოდ იმ დოკუმენტებს, რომლებიც შეიცავს მოცემულ ველს.

// • $ne ოპერატორი გვეხმარება იმის შემოწმებაში, ველი არ უდრის თუ არა მითითებულ მნიშვნელობას.

// • $and და $or ოპერატორები გვეხმარებიან AND ან OR ლოგიკური ოპერატორების შესრულებაში.

// .pretty() გამოიყენება მონაცემების განლაგების გალამაზებისთვის

// მასივის ერთი ელემენტის შესატყვისად შეგვიძლია გამოვიყენოთ .find() მეთოდი და გადავცეთ მოთხოვნის დოკუმენტი, რომელიც შეიცავს ველის სახელს და იმ ელემენტს, რომლის შესატყვისადაც გვინდა მისი მნიშვნელობა.

// • მასივში მრავალი ელემენტის შესატყვისად, შეგვიძლია გამოვიყენოთ $all ოპერატორი .find() მეთოდზე.

// • $all ოპერატორი შეატყობს ნებისმიერ დოკუმენტს, სადაც მოცემული მასივის ველი შეიცავს ყველა მითითებულ მნიშვნელობას, ნებისმიერი თანმიმდევრობით და მასივში სხვა ელემენტების მიუხედავად.

// • შეგვიძლია გამოვიყენოთ .find() მეთოდი შედარების ოპერატორებთან ერთად იმ დოკუმენტების შესატყვისად, სადაც მასივი შეიცავს ერთ ან მეტ ელემენტს, რომლებიც აკმაყოფილებენ მოთხოვნის პირობებს რაიმე კომბინაციაში.

// • იმ დოკუმენტების შესატყვისად, სადაც მასივი შეიცავს ერთ ან მეტ ელემენტს, რომლებიც აკმაყოფილებენ მოთხოვნის ყველა პირობას, შეგვიძლია გამოვიყენოთ $elemMatch ოპერატორი .find() მეთოდზე.