// 1) კომენტარების სახით ახსენით განასხვავება TCP, UDP, TLS - თითოეულის დანიშნულება ახსენით თქვენი სიტყვებით, კარგად გაიაზრეთ, აგრეთვე მოიყვანეთ მაგალითებიც

// TCP - Transmission Control Protocol არის პროტოკოლი, რომელიც ზუსტად აწვდის მონაცემებს, თანმიმდევრულად და დაკარგვის გარეშე.

// მონაცემების გაგზავნამდე TCP ქმნის კავშირს 3-way handshake.

// არის ნელი, მაგრამ ზუსტი და უსაფრთხო

// მაგალითად ვებსაიტები ჩასატვირთად იყენებენ TPC-ის (HTTP / HTTPS);



// UDP (User Datagram Protocol) არის ძალიან სწრაფი, მაგრამ არა ზუსტი; არ გვაქვს გარანტია რომ ყველაფერი თანმიმდევრობით და სრული მივა

// მაგ: YouTube Live, Twitch;


// TLS (Transport Layer Security) - ფარავს მონაცემებს მესამე პირისთვის, იგებს ვინ არის მეორე პირი, გადასცემს მონაცემებს სრულად;

// მაგ: HTTPS, VPN PROTOCOLS