// app.use()	გამოიყენება ყველა ტიპის მოთხოვნისთვის (GET, POST, PUT და ა.შ.). ის ეშვება ნებისმიერ მისამართზე, თუ კონკრეტული path არ მივუთითეთ. გამოიყენება ზოგადი ლოგიკისთვის (ლოგირება, ავტორიზაცია).
// app.get() / app.post()	ეს არის Route-Specific მეთოდები. ისინი ეშვება მხოლოდ მაშინ, როცა კლიენტი აკეთებს კონკრეტული ტიპის მოთხოვნას (მაგალითად, მხოლოდ GET) კონკრეტულ მისამართზე.


// შუამავალი ფუნქცია არის კოდის ბლოკი, რომელიც ეშვება მოთხოვნის (Request) მიღებასა და პასუხის (Response) გაგზავნას შორის. მას აქვს წვდომა req ობიექტთან, res ობიექტთან და მომდევნო ფუნქციასთან, რომელსაც ეწოდება next.


// next() არის "გადამრთველი". Express-ში middleware-ები ქმნიან ჯაჭვს.

// თუ ფუნქციის ბოლოს არ გამოიძახებ next()-ს, მოთხოვნა იქ გაჩერდება (დაეკიდება) და შემდეგი კოდი აღარ შესრულდება.

// next() ეუბნება Express-ს: "მე ჩემი საქმე მოვრჩი, ახლა გადაეცი მოთხოვნა რიგში მდგომ მომდევნო ფუნქციას".


// რაში გვეხმარება შუამავალი ფუნქციები?
// კოდის რეუტილიზაცია: ერთხელ დაწერილი ავტორიზაციის კოდი შეგიძლია გამოიყენო ასობით სხვადასხვა გვერდზე.

// უსაფრთხოება: სანამ მომხმარებელი მონაცემებს დაინახავს, middleware-ით ამოწმებ, აქვს თუ არა მას ამის უფლება.

// მონაცემთა მომზადება: შეგიძლია req ობიექტს დაამატო სასარგებლო ინფორმაცია (როგორც ზემოთ მაგალითში requestTime დავამატეთ), რომელიც მერე controller-ში დაგჭირდება.

// შეცდომების მართვა: ცენტრალიზებულად მართავ აპლიკაციაში წარმოქმნილ შეცდომებს.