#debugging არის შეცდომების გასწორება, debugging იყოფა რამდენიმე ეტაპად, ესენია: შემოწმება, პრობლემის თავიდან წარმოდგენა,  გადაწყვეტა-მიძიება და შესწორება, ტესტირება-კვლავ გადამოწმება სწორია თუ არა; 

#case-sensitive არის პროგრამირების ენა, მაშინ თუ კოდის წერის დროს მნიშვნელობა აქვს დიდი სიმბოლოს გამოვიყენებთ თუ პატარას, case-insensitive არის პრგრამირების ენა, რომლისთვისაც მნიშვნელობა არ აქვს სიმბოლოს დიდი ასოთი დავწერთ თუ პატარათი.
#case-insensitive პროგრამირების ენები/ტექნოლოგიებია: HTML, Pascal, CSS; 
# case-sensitive პროგრამირების ენები/ტექნოლოგიებია:Python, Java, C++;


year = 2010
year = 2014
year = 2015
year = 2024
year = 2025
print(year)
