// მოიძიეთ დამატებითი ინფორმაცია react ის შესახებ, ისწავლეთ რა არის რეაქთში კომპონენტი და რა არის jsx 


// React სწრაფია. React-ში შექმნილ აპლიკაციებს შეუძლიათ რთული განახლებების დამუშავება და ამავდროულად, არიან სწრაფად რეაგირებადი.

// React მოდულურია. კოდის დიდი ფაილების დაწერის ნაცვლად, შეგიძლიათ დაწეროთ მრავალი პატარა, მრავალჯერადი გამოყენების ფაილი. React-ის მოდულარობა შეიძლება იყოს შესანიშნავი გადაწყვეტა JavaScript-ის მხარდაჭერის პრობლემებისთვის.

// React მასშტაბირებადია. დიდი პროგრამები, რომლებიც აჩვენებენ უამრავ ცვალებად მონაცემს, არის ის, სადაც React საუკეთესოდ მუშაობს.

// React მოქნილია. თქვენ შეგიძლიათ გამოიყენოთ React საინტერესო პროექტებისთვის, ის არის opensource library.

// React პოპულარულია. მიუხედავად იმისა, რომ ამ მიზეზს, რა თქმა უნდა, არაფერი აქვს საერთო React-ის ხარისხთან, სიმართლე ისაა, რომ React-ის გაგება უფრო მოთხოვნადს გხდით.


// React Components არიან დამოუკიდლი და მრავალჯერადად გამოყენებადი ბიტები. იგივე მიზaნი აქვთ, რაც js ფუნქციებს, მაგრამ არიანი იზოლირებული და აბრუნებენ HTML. 

function Car() {
    return (
        <h2>Hi, I am a Car!</h2>
    );
}


// JSX ნიშნავს JavaScript XML-ს.

// JSX საშუალებას გვაძლევს დავწეროთ HTML React-ში.

// JSX აადვილებს HTML-ის ჩაწერას და დამატებას React-ში.

// JSX კოდირება
// JSX საშუალებას გვაძლევს დავწეროთ HTML ელემენტები JavaScript-ში და მოვათავსოთ ისინი DOM-ში createElement() და/ან appendChild() მეთოდების გარეშე.

// JSX გარდაქმნის HTML თეგებს react ელემენტებად.

// თქვენ არ გჭირდებათ JSX-ის გამოყენება, მაგრამ JSX აადვილებს React აპლიკაციების ჩაწერას.