import Maintain from "./maintain";
import Exersize from "./exersize";

function App() {
  return (
    <>
      {/* შექმენით მთავარი კომპონენტი, გასტილეთ ის external css - ის გამოყენებით, მოიძეთ ინფორმაცია თუ როგორ ხდება React - ში external css - ის გამოყენება, შეგიძლიათ დაყოთ პატარ-პატარა კომპონენტებად და საბოლოოდ გამოიძახოთ ისინი App კომპონენტში */}

      <Maintain />

      {/* მოკლედ (2–3 წინადადებით) დაწერე, რატომ შეიძლება აირჩიო React ჩვეულ ე.წ. “vanilla JS”-ზე მუშაობის ნაცვლად.
      React.js არის JavaScript ბიბლიოთეკა, რომელიც შემუშავებულია Facebook-ის ინჟინრების მიერ. აქ მოცემულია მხოლოდ რამდენიმე მიზეზი, რის გამოც ადამიანები ირჩევენ React-ით პროგრამირებას:

      React სწრაფია. React-ში შექმნილ აპლიკაციებს შეუძლიათ რთული განახლებების დამუშავება და ამავდროულად სწრაფი და რეაგირებადი.
      React მოდულურია. კოდის დიდი, მკვრივი ფაილების დაწერის ნაცვლად, შეგიძლიათ დაწეროთ მრავალი პატარა, მრავალჯერადი ფაილი.
      React მასშტაბირებადია. დიდი პროგრამები, რომლებიც აჩვენებენ უამრავ ცვალებად მონაცემს, არის ის, სადაც React საუკეთესოდ მუშაობს.
      React მოქნილია. თქვენ შეგიძლიათ გამოიყენოთ React საინტერესო პროექტებისთვის, რომლებსაც არაფერი აქვთ საერთო ვებ აპლიკაციის შექმნასთან. ხალხი ჯერ კიდევ იკვლევს React-ის პოტენციალს.
      React პოპულარულია. მიუხედავად იმისა, რომ ამ მიზეზს, რა თქმა უნდა, არაფერი აქვს საერთო React-ის ხარისხთან, სიმართლე ისაა, რომ React-ის გაგება უფრო მოთხოვნადს გაგხდით.
      თუ React-ში ახალი ხართ, მაშინ ეს კურსი თქვენთვისაა - React-ის წინასწარი ცოდნა არ არის მოსალოდნელი. თავიდანვე დავიწყებთ და ნელ-ნელა ვიმუშავებთ. ბოლოს თქვენ მზად იქნებით React-ში პროგრამირებისთვის და რეალურად გეცოდინებათ, თუ რას აკეთებთ.
      */}
      <Exersize />
    </>
  )
}

export default App;
