// საკლასო დავალება:

// import { squareOfNum } from "./first";

// შექმენით 3 js-ის ფაილი. 

// პირველში შექმენით ფუნქცია, რომელსაც გადაეცემა რიცხვი და აბრუნებს მის კვადრატს, დააექსპორტეთ ეს ფუნქცია. 

// მეორეში შექმენით ფუნქცია, რომელიც აბრუნებს true-ს თუ გადაცემული რიცხვი ლუწია, სხვა შემთხვევაში false-ს (ამ შემოწმებისთვის გამოიყენეთ ternary operator), დააექსპორტეთ ეს ფუნქცია.

// მესამე ფაილში დააიმპორტეთ ორივე ფუნქცია. ჯერ გამოიძახეთ პირველი და მისი დაბრუნებული მნიშვნელობა გადაეცით მეორე ფუნქციას. საბოლოოდ დაბეჭდეთ მეორე ფუნქციის მიერ დაბრუნებული ინფორმაცია.

import { squareOfNum } from "./first.js";

const squared = squareOfNum(7);

import { evenOrodd } from "./second.js";

const evenodd = evenOrodd(8);

console.log(evenodd);
console.log(squared);