// შექმენით ინტერვალი, რომელიც ფუნქციას გამოიძახებს ყოველ 10 წამში. ამ ფუნქციამ უნდა დაბეჭდოს თქვენი სახელი, გვარი.

// როდესაც მომხმარებელი დააკლიკებს ღილაკს, ეს ინტერვალი უნდა გაუქმდეს

let interval = setInterval(function() {
    console.log("Nini Pheradze");
}, 10000)

let button = document.getElementById('btn1');
button.addEventListener('click', function() {
    clearInterval(interval);
});


// შეადგინეთ კონსტანტა და მასში შეინახეთ მასივი. ამ მასივში უნდა გქონდეთ სთრინგი, რიცხვი, ბულეანი, ობიექტი და მასივი.

// საბოლოოდ დაბეჭდეთ ეს მასივი

// შევქმნათ კონსტანტა და შევინახოთ მასში შერეული ტიპის ელემენტების მასივი
const mixedArray = ["ეს არის სტრიქონი", 12345, true, { name: "ობიექტი", id: 1 }, [10, 20, "nested"]];
console.log(mixedArray);

// შექმენით ერთი ფუნქცია, სახელად travserseArr, რომელსაც ექნება ერთი პარამეტრი (ამ პარამეტრში შეინახება მასივი). ფუნქციის კოდის ბლოკი ისე დაწერეთ, რომ ციკლით გადაუაროთ მასივს და დაბეჭდოთ მისი ყველა ელემენტი.

// ფუნქცია გამოიძახეთ ორჯერ, არგუმენტად გაუწერეთ განსხვავებული მასივები
function traverseArr(arr) {
    for (const item of arr) { 
    console.log(item);
    }
};

