// როდესაც ჩვენი კომპიუტერიდან (წყარო) იგზავნება მოთხოვნა სხვა კომპიუტერზე (მიმღები), მონაცემები შვიდ ფაზას გადის, დაწყებული მე-7 ფენიდან (Application) და დამთავრებული 1-ლი ფენით (Physical). 

// 7	Application	უზრუნველყოფს ინტერფეისს მომხმარებლის აპლიკაციებსა და ქსელურ სერვისებს შორის.	
// 6	Presentation პასუხისმგებელია მონაცემთა ფორმატის, დაშიფვრისა და შეკუმშვის უზრუნველყოფაზე.	
// 5	Session	ამყარებს, მართავს და წყვეტს კავშირებს აპლიკაციებს შორის.
// 4	Transport უზრუნველყოფს მონაცემთა სრულ და საიმედო გადაცემას პროცესებს შორის (TCP/UDP).
// 3	Network პასუხისმგებელია მონაცემთა გადატანაზე და ლოგიკურ მისამართებაზე (IP მისამართები).
// 2	Data Link პასუხისმგებელია ფიზიკურ მისამართებაზე (MAC მისამართები) და შეცდომის კონტროლზე ლოკალურ ქსელში.
// 1	Physical უზრუნველყოფს მონაცემთა გადაცემას ფიზიკურ მედიაში (კაბელები, Wi-Fi) ბიტების სახით.