import Parent from "./Parent";

function App() {
  const userName = "Phera";
  return (
    <>
      {/* კომენტარების სახით ახსენით თუ რა არის props drilling - ისაუბრეთ თუ რატომ არის props drilling - ი პრობლემატური, ასევე მოიძიეთ ინფორმაცია იმასთან დაკავშირებით თუ როგორ შეგვიძლია ამ პრობლემის გადაჭრა */}

      {/* props drilling გულისხმობს მონაცემების React-ში ჩადგმული კომპონენტების რამდენიმე ფენაში გადაცემის პრაქტიკას, მიუხედავად იმისა, რომ შუალედური კომპონენტები პირდაპირ არ იყენებენ ამ მონაცემებს. ეს ნიშნავს, რომ შუალედურ კომპონენტს მონაცემები აუცილებლად არ სჭირდება, მაგრამ მან მაინც უნდა გადასცეს ის შემდეგ კომპონენტს, რაც ქმნის პროპების არასაჭირო და ზოგჯერ გრძელ ჯაჭვს. */}

      {/* კოდის სირთულე: ეს კომპონენტების ხეს ზედმეტად ართულებს, რადგან შუალედური კომპონენტები იღებენ და გადასცემენ პროპებს მათი გამოყენების გარეშე, რაც ართულებს თქვენს კოდს და იწვევს დაბნეულობას.
      ტექნიკური მომსახურების ხარჯები: პროპებში ნებისმიერი ცვლილება მოითხოვს მრავალი კომპონენტის განახლებას, რაც შეიძლება დიდ დროსა და შეცდომებს მოითხოვდეს.
      შემცირებული წაკითხვადობა: ძნელია იმის თვალყურის დევნება, თუ როგორ და სად მიედინება მონაცემები კომპონენტებში, რაც ართულებს გამართვას და განვითარებას.
      კომპონენტების მჭიდრო კავშირი: კომპონენტები ხდება ნაკლებად მრავალჯერადი და უფრო მჭიდროდ დაკავშირებული, რაც იწვევს მოქნილობის შემცირებას და რეფაქტორინგის სირთულეებს.
      მასშტაბირების პრობლემები: აპლიკაციის ზრდასთან ერთად, პროპების შესწავლა უარესდება, რაც იწვევს შემდგომ სირთულეს და ართულებს აპლიკაციის ეფექტურად მასშტაბირებას. */}


      {/* React Context API უზრუნველყოფს კომპონენტებს შორის მნიშვნელობების (როგორიცაა მდგომარეობა, ფუნქციები ან მუდმივები) გაზიარების გზას მოთხოვნილებების  ზუსტი გადაცემის გარეშე. */}

      {/* მორგებული ჰუკები React-ში მრავალჯერადი გამოყენების ფუნქციებია, რომლებიც მოიცავს მდგომარეობის ლოგიკას, დაწყებული use-ით (მაგ., useFetch). ისინი აუმჯობესებენ კოდის მრავალჯერადი გამოყენების შესაძლებლობას, ინარჩუნებენ კომპონენტების სისუფთავეს და საშუალებას იძლევიან ლოგიკის გაზიარებას კომპონენტებს შორის. */}

      {/*  Global State Management (Redux, Zustand, MobX) 
      ამ მიდგომაში ჩვენ ვიყენებთ ბიბლიოთეკებს, როგორიცაა Redux, Zustand ან MobX, რომლებიც აპლიკაციის მდგომარეობას გლობალურად მართავენ, რაც მთლიანად გამორიცხავს პროპელერის ბურღვის საჭიროებას. */}
      <div>
        <h1>Props Drilling Example</h1>
        <Parent userName={userName} />
      </div>
    </>
  )
}

export default App
