// aggregation არის დიდი მონაცამების ეტაპობრივი გაფილტვრის, გადამუშავების, დაჯგუფებისა და მათზე მათემატიკური/ლოგიკური გამოთვლების ჩატარების პროცესი, რომელიც იძლევა ერთიან ანალიტიკურ დასკვნას.

// aggregation ძირითადი მექანიზმია Pipeline, მასში შედის კოლექცია და ბრუნდება შედეგი, pipeline იყოფა სეგმენტებად - STAGE, ყოველი stage ერთ კონკრეტულ ოპერაციას ასრულებს, მათ თანმიმდევრობას აქვს გადამწყვეტი მნიშვნელობა, რადგან მონაცემები ზუსტად შენ მიერ მინიჭებული რიგითობით მიედინება.

// გამოიყენება .aggregate() მეთოდი, რომელიც არგუმენტებად იღებს მასივს []. 